{
  "ir_version": "1.2.0",
  "plan_name": "vendflow_vending_machine_management_platform",
  "entities": {
    "alert": {
      "class": "Alert",
      "table": "alerts",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "machine_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "machines.id",
          "fk": "machine"
        },
        {
          "name": "alert_type",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "severity",
          "type": "String",
          "type_args": [
            20
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'medium'",
          "server_default_value": "medium"
        },
        {
          "name": "message",
          "type": "Text",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "is_acknowledged",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "False",
          "default_value": false
        },
        {
          "name": "acknowledged_by",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false,
          "fk_ref": "users.id",
          "fk": "user"
        },
        {
          "name": "acknowledged_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "resolved_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "data_json",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "machine",
        "user"
      ],
      "table_args_unique": [],
      "name": "alert",
      "source_file": "models/alert.py",
      "fk_parents": [
        "machine"
      ]
    },
    "analytics": {
      "class": "Analytics",
      "table": "analytics",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "title",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "description",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "status",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'active'",
          "server_default_value": "active"
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [],
      "table_args_unique": [],
      "name": "analytics",
      "source_file": "models/analytics.py",
      "fk_parents": []
    },
    "daily_report": {
      "class": "DailyReport",
      "table": "daily_reports",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "machine_id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "machines.id",
          "fk": "machine"
        },
        {
          "name": "report_date",
          "type": "Date",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "total_transactions",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "0",
          "default_value": 0
        },
        {
          "name": "total_revenue",
          "type": "Numeric",
          "type_args": [
            12,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "card_revenue",
          "type": "Numeric",
          "type_args": [
            12,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "cash_revenue",
          "type": "Numeric",
          "type_args": [
            12,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "items_sold",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "0",
          "default_value": 0
        },
        {
          "name": "avg_transaction",
          "type": "Numeric",
          "type_args": [
            10,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "uptime_hours",
          "type": "Numeric",
          "type_args": [
            8,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "alerts_count",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "0",
          "default_value": 0
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "machine"
      ],
      "table_args_unique": [],
      "name": "daily_report",
      "source_file": "models/daily_report.py",
      "fk_parents": [
        "machine"
      ]
    },
    "email_send_log": {
      "class": "EmailSendLog",
      "table": "email_send_logs",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "lead_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "leads.id",
          "fk": "lead"
        },
        {
          "name": "sequence_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "email_sequences.id",
          "fk": "email_sequence"
        },
        {
          "name": "step_number",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'0'",
          "default_src": "0",
          "server_default_value": "0",
          "default_value": 0
        },
        {
          "name": "subject",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "status",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "sent_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "opened_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "clicked_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "email_sequence",
        "lead"
      ],
      "table_args_unique": [],
      "name": "email_send_log",
      "source_file": "models/email_send_log.py",
      "fk_parents": [
        "lead"
      ]
    },
    "email_sequence": {
      "class": "EmailSequence",
      "table": "email_sequences",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "operator_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "operators.id",
          "fk": "operator"
        },
        {
          "name": "name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "trigger_status",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "steps_json",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "is_active",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'1'",
          "default_src": "True",
          "server_default_value": "1",
          "default_value": true
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "operator"
      ],
      "table_args_unique": [],
      "name": "email_sequence",
      "source_file": "models/email_sequence.py",
      "fk_parents": [
        "operator"
      ]
    },
    "inventory": {
      "class": "InventoryItem",
      "table": "inventories",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "machine_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "machines.id",
          "fk": "machine"
        },
        {
          "name": "product_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "products.id",
          "fk": "product"
        },
        {
          "name": "slot_number",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "current_qty",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'0'",
          "default_src": "0",
          "server_default_value": "0",
          "default_value": 0
        },
        {
          "name": "max_qty",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "last_restocked_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "machine",
        "product"
      ],
      "table_args_unique": [
        {
          "columns": [
            "machine_id",
            "slot_number"
          ],
          "name": "uq_inventory_machine_slot"
        }
      ],
      "name": "inventory",
      "source_file": "models/inventory.py",
      "fk_parents": [
        "machine",
        "product"
      ]
    },
    "lead": {
      "class": "Lead",
      "table": "leads",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "operator_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "operators.id",
          "fk": "operator"
        },
        {
          "name": "business_name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "contact_name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_email",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_phone",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "address",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "city",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "state",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "zip_code",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "latitude",
          "type": "Float",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "longitude",
          "type": "Float",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "business_type",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "status",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "source",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "notes",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "next_follow_up_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "mockup_image_url",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "operator"
      ],
      "table_args_unique": [],
      "name": "lead",
      "source_file": "models/lead.py",
      "fk_parents": [
        "operator"
      ]
    },
    "location": {
      "class": "Location",
      "table": "locations",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "operator_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "operators.id",
          "fk": "operator"
        },
        {
          "name": "name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "address",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "city",
          "type": "String",
          "type_args": [
            100
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "state",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "zip_code",
          "type": "String",
          "type_args": [
            20
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "latitude",
          "type": "Float",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "longitude",
          "type": "Float",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "location_type",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_phone",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "notes",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "is_active",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "True",
          "default_value": true
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "operator"
      ],
      "table_args_unique": [],
      "name": "location",
      "source_file": "models/location.py",
      "fk_parents": [
        "operator"
      ]
    },
    "machine": {
      "class": "Machine",
      "table": "machines",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "serial_number",
          "type": "String",
          "type_args": [
            100
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": true,
          "index": true,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "machine_type",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'ice'",
          "server_default_value": "ice"
        },
        {
          "name": "name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "manufacturer",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "model",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "status",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'active'",
          "server_default_value": "active"
        },
        {
          "name": "operator_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false,
          "fk_ref": "operators.id",
          "fk": "operator"
        },
        {
          "name": "location_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false,
          "fk_ref": "locations.id",
          "fk": "location"
        },
        {
          "name": "terminal_id",
          "type": "String",
          "type_args": [
            100
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false,
          "fk": "terminal"
        },
        {
          "name": "pi_device_id",
          "type": "String",
          "type_args": [
            100
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false,
          "fk": "pi_device"
        },
        {
          "name": "sim_iccid",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "firmware_version",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "temperature",
          "type": "Float",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "is_online",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "False",
          "default_value": false
        },
        {
          "name": "is_active",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "True",
          "default_value": true
        },
        {
          "name": "last_service_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "last_restock_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "last_telemetry_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "installed_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "edge_mode",
          "type": "String",
          "type_args": [
            20
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'im30_only'",
          "server_default_value": "im30_only"
        },
        {
          "name": "connectivity_type",
          "type": "String",
          "type_args": [
            20
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'cellular'",
          "server_default_value": "cellular"
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [
        "location",
        "operator",
        "pi_device",
        "terminal"
      ],
      "table_args_unique": [],
      "name": "machine",
      "source_file": "models/machine.py",
      "fk_parents": [
        "location",
        "operator"
      ]
    },
    "marketing_template": {
      "class": "MarketingTemplate",
      "table": "marketing_templates",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "category",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "template_type",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "content_html",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "thumbnail_url",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "is_active",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "'1'",
          "default_src": "True",
          "server_default_value": "1",
          "default_value": true
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [],
      "table_args_unique": [],
      "name": "marketing_template",
      "source_file": "models/marketing_template.py",
      "fk_parents": []
    },
    "operator": {
      "class": "Operator",
      "table": "operators",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "contact_name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_email",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "contact_phone",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "address",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "city",
          "type": "String",
          "type_args": [
            100
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "state",
          "type": "String",
          "type_args": [
            50
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "zip_code",
          "type": "String",
          "type_args": [
            20
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "machine_count",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "0",
          "default_value": 0
        },
        {
          "name": "monthly_volume",
          "type": "Numeric",
          "type_args": [
            14,
            2
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "processing_rate",
          "type": "Numeric",
          "type_args": [
            5,
            2
          ],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "3.0",
          "default_value": 3.0
        },
        {
          "name": "software_rate",
          "type": "Numeric",
          "type_args": [
            6,
            2
          ],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "9.0",
          "default_value": 9.0
        },
        {
          "name": "is_active",
          "type": "Boolean",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "True",
          "default_value": true
        },
        {
          "name": "created_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        },
        {
          "name": "updated_at",
          "type": "DateTime",
          "type_args": [],
          "nullable": true,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "default_src": "datetime.utcnow",
          "onupdate_src": "datetime.utcnow",
          "default_value": "datetime.utcnow"
        }
      ],
      "pk": "id",
      "fks": [],
      "table_args_unique": [],
      "name": "operator",
      "source_file": "models/operator.py",
      "fk_parents": []
    },
    "operator_website": {
      "class": "OperatorWebsite",
      "table": "operator_websites",
      "fields": [
        {
          "name": "id",
          "type": "Integer",
          "type_args": [],
          "nullable": false,
          "default": false,
          "primary_key": true,
          "unique": false,
          "index": true,
          "autoincrement": true
        },
        {
          "name": "operator_id",
          "type": "Integer",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": true,
          "fk_ref": "operators.id",
          "fk": "operator"
        },
        {
          "name": "domain",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "subdomain",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "company_name",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": false,
          "default": true,
          "primary_key": false,
          "unique": false,
          "index": false,
          "server_default_src": "''",
          "server_default_value": ""
        },
        {
          "name": "tagline",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "logo_url",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "primary_color",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "phone",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "email",
          "type": "String",
          "type_args": [
            255
          ],
          "nullable": true,
          "default": false,
          "primary_key": false,
          "unique": false,
          "index": false
        },
        {
          "name": "about_text",
          "type": "Text",
          "type_args": [],
          "nullable": true,
          "default": false,
          "primary_key": false,
